Revit 2015 API
DefaultDivideSettings.GetLayout Method
 Gets the default Divided Surface layout for U or V gridlines. This method is obsolete in Revit 2015. Use getSurfaceLayout instead.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
[ObsoleteAttribute]
public SpacingRuleLayout GetLayout(
	UVGridlineType gridlines
)
Visual Basic
<ObsoleteAttribute> _
Public Function GetLayout ( _
	gridlines As UVGridlineType _
) As SpacingRuleLayout
Visual C++
[ObsoleteAttribute]
public:
SpacingRuleLayout GetLayout(
	UVGridlineType gridlines
)
Parameters
gridlines
Type: Autodesk.Revit.DB.UVGridlineType
 U-gridlines or V-gridlines.
Return Value
 The layout spacing rule.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
DefaultDivideSettings Class
Autodesk.Revit.DB Namespace